IDS_LOCK_APPLY_NEW_PROJ                       = "將會套用於新專案"
IDS_MAIN_PROTECTION_KEYTYPE_STANDALONE        = "單機版"
IDS_MAIN_PROTECTION_KEYTYPE_NETWORK           = "網路版"
IDS_MAIN_PROTECTION_KEYTYPE_LICENSE_SERVER    = "License-Server"
IDS_MAIN_PROTECTION_PROTOCOL_TCPIP            = "TCP/IP"
IDS_MAIN_PROTECTION_PROTOCOL_IPXSPX           = "IPX/SPX"
IDS_MAIN_PROTECTION_PROTOCOL_NETBEUI          = "NetBEUI"
IDS_MAIN_PROTECTION_PROTOCOL_SAP              = "SAP"

IDS_MAIN_MANUAL_FILE_NOT_EXIST                = "手冊文件已遺失"
IDS_MAIN_TOOLTIP_KEEP_SECT_REBAR01            = "斷面與鋼筋資料將被保留"
IDS_MAIN_TOOLTIP_KEEP_SECT_REBAR02            = "僅構件外力與其他設計資訊透過Gen/ADS Link進行更新"

IDS_MEC_ERROR_FAIL_WEB_AUTH                   = "授權失敗"
IDS_MEC_LONG_USERID                           = "帳號名稱過長"
IDS_MEC_LONG_PASSWORD                         = "密碼過長"
IDS_MEC_ENTER_USERID                          = "請輸入您的帳號名稱"
IDS_MEC_ENTER_PASSWORD                        = "請輸入您的密碼"
IDS_MEC_CONFIRM_NODELOCK_SYSTEM               = "註冊過程中將會永久記錄這台機器\n確定要註冊嗎?"
IDS_MEC_REGISTRAITON_SUCCESS                  = "註冊成功"
IDS_MEC_TRANSLATION_SUCCESS                   = "已成功轉換 %s 檔案"

IDS_MAIN_PROTECTION__Err_Lock_Key_Number      = "[錯誤] 序號的第 %d 個字元不正確"
IDS_MAIN_PROTECTION__Err_Lock_Key_Number_16   = "[錯誤] 序號為一組16個字元的字串"
IDS_MAIN_PROTECTION_KEYTYPE_INTERNET          = "Internet"
IDS_MAIN_PROTECTION_WEBTYPE_NODE              = "Node Lock"
IDS_MAIN_PROTECTION_WEBTYPE_FLOATING          = "Floating Lock"
IDS_MAIN_PROTECTION_INPUT_IDPW                = "請輸入帳號名稱與密碼"
IDS_MAIN_PROTECTION_cannot_change_any_program_options_at_work  = "程式運行中，無法進行變更"
IDS_MAIN_PROTECTION_Another_application_is_already_running_at_this_system  = "另一個應用程序正在運行中 \n無法停用"
IDS_MAIN_PROTECTION_INITIALIZE                = "要初始化認證資料嗎?"
IDS_MAIN_PROTECTION_INITIALIZE_FAIL           = "初始化失敗"
IDS_MAIN_PROTECTION_INITIALIZE_SUCCEED        = "認證資料已成功初始化"
IDS_MAIN_PROTECTION_Hardware_Lock             = "硬體鎖"

IDS_MAIN_PROCEDURE_DGN                        = "補強設計家"
IDS_MAIN_PROCEDURE_RCS                        = "RC設計家"
IDS_MAIN_PROCEDURE_STL                        = "鋼構設計家"
IDS_MAIN_PROCEDURE_SRC                        = "SRC設計家"
IDS_MAIN_PROCEDURE_ALU                        = "鋁構設計家"

IDS_MAIN_MATERIAL_NAME_RCS                    = "RC造"
IDS_MAIN_MATERIAL_NAME_STL                    = "鋼構造"
IDS_MAIN_MATERIAL_NAME_SRC                    = "SRC造"
IDS_MAIN_MATERIAL_NAME_ALU                    = "鋁構造"
IDS_MAIN_MATERIAL_NAME_RFM                    = "構件補強"
IDS_MAIN_MATERIAL_NAME_PBD                    = "Peform-Base Design"
IDS_MAIN_MATERIAL_NAME_CFS                    = "冷軋型鋼"
IDS_MAIN_MATERIAL_NAME_RCS_CAP                = "RC造"
IDS_MAIN_MATERIAL_NAME_STL_CAP                = "鋼構造"
IDS_MAIN_MATERIAL_NAME_SRC_CAP                = "SRC造"
IDS_MAIN_MATERIAL_NAME_ALU_CAP                = "鋁構造"
IDS_MAIN_MATERIAL_NAME_RFM_CAP                = "構件補強"
IDS_MAIN_MATERIAL_NAME_PBD_CAP                = "Peform-Base Design"
IDS_MAIN_MATERIAL_NAME_CFS_CAP                = "冷軋型鋼"

IDS_MAIN_MEMBER_NAME_PINFO                    = "Project Information"
IDS_MAIN_MEMBER_NAME_GUOPT                    = "選項"
IDS_MAIN_MEMBER_NAME_DBASE                    = "資料庫"
IDS_MAIN_MEMBER_NAME_GUSOP                    = "鋼構選項"
IDS_MAIN_MEMBER_NAME_GUAOP                    = "鋁構選項"
IDS_MAIN_MEMBER_NAME_DGNOP                    = "設計選項 ( Member )"
IDS_MAIN_MEMBER_NAME_DWGOP                    = "繪圖選項 ( Member )"
IDS_MAIN_MEMBER_NAME_GPREF                    = "偏好設定"
IDS_MAIN_MEMBER_NAME_GROUP                    = "群組"
IDS_MAIN_MEMBER_NAME_GLOAD                    = "設計載重"
IDS_MAIN_MEMBER_NAME_GLIOP                    = "連結選項"
IDS_MAIN_MEMBER_NAME_GULOP                    = "UP Link Option"
IDS_MAIN_MEMBER_NAME_GURWO                    = "批量牆設計選項"
IDS_MAIN_MEMBER_NAME_GLINK                    = "連結"
IDS_MAIN_MEMBER_NAME_CHKOP                    = "檢核選項"
IDS_MAIN_MEMBER_NAME_RPTOP                    = "報告選項"
IDS_MAIN_MEMBER_NAME_LAYOP                    = "鋼筋配置選項"
IDS_MAIN_MEMBER_NAME_NUMOP                    = "數字選項"
IDS_MAIN_MEMBER_NAME_REBAR                    = "鋼筋選項"
IDS_MAIN_MEMBER_NAME_RFACT                    = "使用者定義強度減少係數"
IDS_MAIN_MEMBER_NAME_GSLAB                    = "樓版"
IDS_MAIN_MEMBER_NAME_GURBE                    = "梁"
IDS_MAIN_MEMBER_NAME_GURCO                    = "柱"
IDS_MAIN_MEMBER_NAME_GURGC                    = "柱( 任意斷面 )"
IDS_MAIN_MEMBER_NAME_GURSW                    = "剪力牆"
IDS_MAIN_MEMBER_NAME_GURDW                    = "剪力牆( 組合 )"
IDS_MAIN_MEMBER_NAME_GUFDN                    = "基礎"
IDS_MAIN_MEMBER_NAME_GUFDL                    = "基礎( Line )"
IDS_MAIN_MEMBER_NAME_GUCBF                    = "基礎( General Combined )"
IDS_MAIN_MEMBER_NAME_GURCF                    = "基礎( 聯合 )"
IDS_MAIN_MEMBER_NAME_GURBW                    = "地下室外牆"
IDS_MAIN_MEMBER_NAME_GURBU                    = "扶壁"
IDS_MAIN_MEMBER_NAME_GURST                    = "樓梯"
IDS_MAIN_MEMBER_NAME_GURCB                    = "托梁 / 托架"
IDS_MAIN_MEMBER_NAME_GURSL                    = "樓版表格"
IDS_MAIN_MEMBER_NAME_GURBL                    = "梁表格"

IDS_MAIN_MEMBER_NAME_GURBB                    = "Batch Beam"
IDS_MAIN_MEMBER_NAME_GBBOP                    = "Batch Beam ( Option )"
IDS_MAIN_MEMBER_NAME_GBBST                    = "Batch Beam ( Story )"
IDS_MAIN_MEMBER_NAME_GBBCN                    = "Batch Beam ( Connectivity )"
IDS_MAIN_MEMBER_NAME_GBBGR                    = "Batch Beam ( Grouping )"
IDS_MAIN_MEMBER_NAME_GBBBE                    = "Batch Beam ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBBCO                    = "Batch Beam ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBBSW                    = "Batch Beam ( RC Wall )"
IDS_MAIN_MEMBER_NAME_GBBSG                    = "Batch Beam ( Steel Beam / Column )"

IDS_MAIN_MEMBER_NAME_GURBC                    = "Batch Column"
IDS_MAIN_MEMBER_NAME_GBCOP                    = "Batch Column ( Option )"
IDS_MAIN_MEMBER_NAME_GBCST                    = "Batch Column ( Story )"
IDS_MAIN_MEMBER_NAME_GBCCN                    = "Batch Column ( Connectivity )"
IDS_MAIN_MEMBER_NAME_GBCGR                    = "Batch Column ( Grouping )"
IDS_MAIN_MEMBER_NAME_GBCCO                    = "Batch Column ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBCGC                    = "Batch Column ( RC General Column )"
IDS_MAIN_MEMBER_NAME_GBCBE                    = "Batch Column ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBCSW                    = "Batch Column ( RC Wall )"
IDS_MAIN_MEMBER_NAME_GBCSG                    = "Batch Column ( Steel Beam / Column )"

IDS_MAIN_MEMBER_NAME_GURGW                    = "批量牆"
IDS_MAIN_MEMBER_NAME_GBWOP                    = "批量牆( 選項 )"
IDS_MAIN_MEMBER_NAME_GBWST                    = "批量牆( 樓層 )"
IDS_MAIN_MEMBER_NAME_GBWUW                    = "批量牆( 單元牆 )"
IDS_MAIN_MEMBER_NAME_GBWWA                    = "批量牆( 牆 )"
IDS_MAIN_MEMBER_NAME_GBWWM                    = "批量牆( 牆標記 )"
IDS_MAIN_MEMBER_NAME_GBWBE                    = "Batch Wall ( RC Beam )"
IDS_MAIN_MEMBER_NAME_GBWCO                    = "Batch Wall ( RC Column )"
IDS_MAIN_MEMBER_NAME_GBWSG                    = "Batch Wall ( Steel Beam / Column )"
IDS_MAIN_MEMBER_NAME_GURRW                    = "擋土牆"
IDS_MAIN_MEMBER_NAME_GURAB                    = "錨定螺栓"

IDS_MAIN_MEMBER_NAME_GUSSG                    = "梁 / 柱"
IDS_MAIN_MEMBER_NAME_GUSCF                    = "冷彎型鋼截面"
IDS_MAIN_MEMBER_NAME_GUSBP                    = "基座板"
IDS_MAIN_MEMBER_NAME_GUSBC                    = "螺栓接合"
IDS_MAIN_MEMBER_NAME_GUSMC                    = "螺栓彎矩接合"
IDS_MAIN_MEMBER_NAME_GUSWO                    = "腹板開孔"
IDS_MAIN_MEMBER_NAME_GUSCG                    = "天車梁"
IDS_MAIN_MEMBER_NAME_GUSPG                    = "桁條 / 圍梁"
IDS_MAIN_MEMBER_NAME_GUSEP                    = "預埋板"
IDS_MAIN_MEMBER_NAME_GUSWE                    = "銲接接合"
IDS_MAIN_MEMBER_NAME_GUSLB                    = "Link Beam"
IDS_MAIN_MEMBER_NAME_GUSST                    = "樓梯"
IDS_MAIN_MEMBER_NAME_GUSWB                    = "Corrugated Web Beam"

IDS_MAIN_MEMBER_NAME_GUCCB                    = "合成梁"
IDS_MAIN_MEMBER_NAME_GUCCO                    = "柱"
IDS_MAIN_MEMBER_NAME_GUCFT                    = "CFT柱"
IDS_MAIN_MEMBER_NAME_GUCBP                    = "基座板"

IDS_MAIN_MEMBER_NAME_GUAMT                    = "梁 / 柱( 任意斷面 )"
IDS_MAIN_MEMBER_NAME_GUAAG                    = "梁 / 柱"

IDS_MAIN_MEMBER_NAME_GUFSL                    = "RC樓版"
IDS_MAIN_MEMBER_NAME_GUFBE                    = "RC梁"
IDS_MAIN_MEMBER_NAME_GUFCO                    = "RC柱"

IDS_MAIN_MEMBER_NAME_GSTUL                    = "無側撐長度"
IDS_MAIN_MEMBER_NAME_GSTBS                    = "側向支撐強度"
IDS_MAIN_MEMBER_NAME_GSTLS                    = "連桿梁加勁板"
IDS_MAIN_MEMBER_NAME_GSTBV                    = "V型斜撐構架梁強度"

IDS_MAIN_MEMBER_NAME_GERCF                    = IDS_MAIN_MEMBER_NAME_GURCF
IDS_MAIN_MEMBER_NAME_GERBE                    = IDS_MAIN_MEMBER_NAME_GURBE
IDS_MAIN_MEMBER_NAME_GERCO                    = IDS_MAIN_MEMBER_NAME_GURCO
IDS_MAIN_MEMBER_NAME_GERGC                    = IDS_MAIN_MEMBER_NAME_GURGC
IDS_MAIN_MEMBER_NAME_GEFDN                    = IDS_MAIN_MEMBER_NAME_GUFDN
IDS_MAIN_MEMBER_NAME_GERSF                    = "基礎( 連續 )"

IDS_MAIN_MEMBER_NAME_GESSG                    = "梁 / 柱"
IDS_MAIN_MEMBER_NAME_GESBP                    = "基座板"
IDS_MAIN_MEMBER_NAME_GESBC                    = "螺栓接合"
IDS_MAIN_MEMBER_NAME_GESMC                    = "螺栓彎矩接合"

IDS_MAIN_MEMBER_NAME_GECCB                    = "合成梁"

IDS_MAIN_MEMBER_NAME_GIRBE                    = IDS_MAIN_MEMBER_NAME_GURBE
IDS_MAIN_MEMBER_NAME_GIRCO                    = IDS_MAIN_MEMBER_NAME_GURCO

IDS_MAIN_MEMBER_NAME_GIRBB                    = IDS_MAIN_MEMBER_NAME_GURBB
IDS_MAIN_MEMBER_NAME_GIBOP                    = IDS_MAIN_MEMBER_NAME_GBBOP
IDS_MAIN_MEMBER_NAME_GIBST                    = IDS_MAIN_MEMBER_NAME_GBBST
IDS_MAIN_MEMBER_NAME_GIBCN                    = IDS_MAIN_MEMBER_NAME_GBBCN
IDS_MAIN_MEMBER_NAME_GIBGR                    = IDS_MAIN_MEMBER_NAME_GBBGR
IDS_MAIN_MEMBER_NAME_GIBBE                    = IDS_MAIN_MEMBER_NAME_GBBBE
IDS_MAIN_MEMBER_NAME_GIBCO                    = IDS_MAIN_MEMBER_NAME_GBBCO
IDS_MAIN_MEMBER_NAME_GIBSW                    = IDS_MAIN_MEMBER_NAME_GBBSW
IDS_MAIN_MEMBER_NAME_GIBSG                    = IDS_MAIN_MEMBER_NAME_GBBSG

IDS_MAIN_MEMBER_NAME_GIRBC                    = IDS_MAIN_MEMBER_NAME_GURBC
IDS_MAIN_MEMBER_NAME_GICOP                    = IDS_MAIN_MEMBER_NAME_GBCOP
IDS_MAIN_MEMBER_NAME_GICST                    = IDS_MAIN_MEMBER_NAME_GBCST
IDS_MAIN_MEMBER_NAME_GICCN                    = IDS_MAIN_MEMBER_NAME_GBCCN
IDS_MAIN_MEMBER_NAME_GICGR                    = IDS_MAIN_MEMBER_NAME_GBCGR
IDS_MAIN_MEMBER_NAME_GICCO                    = IDS_MAIN_MEMBER_NAME_GBCCO
IDS_MAIN_MEMBER_NAME_GICGC                    = IDS_MAIN_MEMBER_NAME_GBCGC
IDS_MAIN_MEMBER_NAME_GICBE                    = IDS_MAIN_MEMBER_NAME_GBCBE
IDS_MAIN_MEMBER_NAME_GICSW                    = IDS_MAIN_MEMBER_NAME_GBCSW
IDS_MAIN_MEMBER_NAME_GICSG                    = IDS_MAIN_MEMBER_NAME_GBCSG

IDS_MAIN_MEMBER_NAME_GIRGW                    = IDS_MAIN_MEMBER_NAME_GURGW
IDS_MAIN_MEMBER_NAME_GIWOP                    = IDS_MAIN_MEMBER_NAME_GBWOP
IDS_MAIN_MEMBER_NAME_GIWST                    = IDS_MAIN_MEMBER_NAME_GBWST
IDS_MAIN_MEMBER_NAME_GIWUW                    = IDS_MAIN_MEMBER_NAME_GBWUW
IDS_MAIN_MEMBER_NAME_GIWWA                    = IDS_MAIN_MEMBER_NAME_GBWWA
IDS_MAIN_MEMBER_NAME_GIWWM                    = IDS_MAIN_MEMBER_NAME_GBWWM
IDS_MAIN_MEMBER_NAME_GIWBE                    = IDS_MAIN_MEMBER_NAME_GBWBE
IDS_MAIN_MEMBER_NAME_GIWCO                    = IDS_MAIN_MEMBER_NAME_GBWCO
IDS_MAIN_MEMBER_NAME_GIWSG                    = IDS_MAIN_MEMBER_NAME_GBWSG

IDS_MAIN_SYSTEM_TYPE_RCS                      = "RC造"
IDS_MAIN_SYSTEM_TYPE_STL                      = "鋼構造"
IDS_MAIN_SYSTEM_TYPE_SRC                      = "SRC造"
IDS_MAIN_SYSTEM_TYPE_SRC2                     = "SRC造"
IDS_MAIN_SYSTEM_TYPE_ALU                      = "鋁構造"
IDS_MAIN_SYSTEM_TYPE_RFM                      = "構件補強"
IDS_MAIN_SYSTEM_TYPE_PBD                      = "Peform-Base Design"
IDS_MAIN_SYSTEM_TYPE_PBD2                     = "PBD"
IDS_MAIN_SYSTEM_TYPE_CFS                      = "冷軋型鋼"
IDS_MAIN_SYSTEM_TYPE_ETC                      = "其他"
IDS_MAIN_SYSTEM_TYPE_FDN                      = "基礎"
IDS_MAIN_SYSTEM_TYPE_CON                      = "接合"

IDS_MAIN_SYS_MEMB_NAME_MENU                   = "選單"
IDS_MAIN_SYS_MEMB_NAME_REPORT                 = "報表預覽"
IDS_MAIN_SYS_MEMB_NAME_GLOAD                  = "設計載重"
IDS_MAIN_SYS_MEMB_NAME_GSLAB                  = "樓版"
IDS_MAIN_SYS_MEMB_NAME_GURBE                  = "梁"
IDS_MAIN_SYS_MEMB_NAME_GURCO                  = "柱"
IDS_MAIN_SYS_MEMB_NAME_GURGC                  = "柱( 任意斷面 )"
IDS_MAIN_SYS_MEMB_NAME_GURSW                  = "剪力牆"
IDS_MAIN_SYS_MEMB_NAME_GURDW                  = "剪力牆 (組合)"
IDS_MAIN_SYS_MEMB_NAME_GWALL                  = "剪力牆( 組合 )"
IDS_MAIN_SYS_MEMB_NAME_GUFDN                  = "基礎"
IDS_MAIN_SYS_MEMB_NAME_GUCBF                  = "基礎( General Combined )"
IDS_MAIN_SYS_MEMB_NAME_GURCF                  = "基礎( 聯合 )"
IDS_MAIN_SYS_MEMB_NAME_GURBW                  = "地下室外牆"
IDS_MAIN_SYS_MEMB_NAME_GURBU                  = "扶壁"
IDS_MAIN_SYS_MEMB_NAME_GURCB                  = "托梁 / 托架"
IDS_MAIN_SYS_MEMB_NAME_GURST                  = "樓梯"
IDS_MAIN_SYS_MEMB_NAME_GURBL                  = "梁表格"
IDS_MAIN_SYS_MEMB_NAME_GURSL                  = "樓版表格"
IDS_MAIN_SYS_MEMB_NAME_GURRW                  = "擋土牆"
IDS_MAIN_SYS_MEMB_NAME_GURAB                  = "錨定螺栓"
IDS_MAIN_SYS_MEMB_NAME_GURBB                  = "Batch Beam"
IDS_MAIN_SYS_MEMB_NAME_GURBC                  = "Batch Column"
IDS_MAIN_SYS_MEMB_NAME_GURGW                  = "批量牆設計"

IDS_MAIN_SYS_MEMB_NAME_GUSSG                  = "梁 / 柱"
IDS_MAIN_SYS_MEMB_NAME_GUSCF                  = "冷彎型鋼"
IDS_MAIN_SYS_MEMB_NAME_GUSBP                  = "基座板"
IDS_MAIN_SYS_MEMB_NAME_GUSBC                  = "螺栓接合"
IDS_MAIN_SYS_MEMB_NAME_GUSMC                  = "螺栓彎矩接合"
IDS_MAIN_SYS_MEMB_NAME_GUSCG                  = "天車梁"
IDS_MAIN_SYS_MEMB_NAME_GUSPG                  = "桁條 / 圍梁"
IDS_MAIN_SYS_MEMB_NAME_GUSWO                  = "腹板開孔"
IDS_MAIN_SYS_MEMB_NAME_GUSEP                  = "預埋板"
IDS_MAIN_SYS_MEMB_NAME_GUSWE                  = "焊接"
IDS_MAIN_SYS_MEMB_NAME_GUSST                  = "樓梯"
IDS_MAIN_SYS_MEMB_NAME_GUSWB                  = "Corrugated Web Beam"

IDS_MAIN_SYS_MEMB_NAME_GUCCB                  = "合成梁"
IDS_MAIN_SYS_MEMB_NAME_GUCCO                  = "柱"
IDS_MAIN_SYS_MEMB_NAME_GUCFT                  = "CFT柱"
IDS_MAIN_SYS_MEMB_NAME_GUCBP                  = "基座板"

IDS_MAIN_SYS_MEMB_NAME_GUEBR                  = "梁補強"
IDS_MAIN_SYS_MEMB_NAME_GUFSL                  = "樓版"
IDS_MAIN_SYS_MEMB_NAME_GUFBE                  = "梁"
IDS_MAIN_SYS_MEMB_NAME_GUFCO                  = "柱"

IDS_MAIN_SYS_MEMB_NAME_GUAMT                  = "梁 / 柱( 任意斷面 )"
IDS_MAIN_SYS_MEMB_NAME_GUAAG                  = "梁 / 柱"

IDS_MAIN_SYS_MEMB_NAME_GERBE                  = IDS_MAIN_SYS_MEMB_NAME_GURBE
IDS_MAIN_SYS_MEMB_NAME_GERCO                  = IDS_MAIN_SYS_MEMB_NAME_GURCO
IDS_MAIN_SYS_MEMB_NAME_GERGC                  = IDS_MAIN_SYS_MEMB_NAME_GURGC
IDS_MAIN_SYS_MEMB_NAME_GERDW                  = IDS_MAIN_SYS_MEMB_NAME_GURDW
IDS_MAIN_SYS_MEMB_NAME_GEFDN                  = IDS_MAIN_SYS_MEMB_NAME_GUFDN
IDS_MAIN_SYS_MEMB_NAME_GERCF                  = IDS_MAIN_SYS_MEMB_NAME_GURCF
IDS_MAIN_SYS_MEMB_NAME_GERSF                  = "基礎 (連續)"

IDS_MAIN_SYS_MEMB_NAME_GESSG                  = IDS_MAIN_SYS_MEMB_NAME_GUSSG
IDS_MAIN_SYS_MEMB_NAME_GESBC                  = IDS_MAIN_SYS_MEMB_NAME_GUSBC
IDS_MAIN_SYS_MEMB_NAME_GESBP                  = IDS_MAIN_SYS_MEMB_NAME_GUSBP
IDS_MAIN_SYS_MEMB_NAME_GESMC                  = IDS_MAIN_SYS_MEMB_NAME_GUSMC

IDS_MAIN_SYS_MEMB_NAME_GECCB                  = IDS_MAIN_SYS_MEMB_NAME_GUCCB

IDS_MAIN_SYS_MEMB_NAME_GISBC                  = IDS_MAIN_SYS_MEMB_NAME_GUSBC

IDS_MAIN_STDG_GRID_ERR_MSG1                   = "[ 錯誤 ] 貼上的內容須為一整行"
IDS_MAIN_STDG_GRID_ERR_MSG2                   = "[ 錯誤 ] 複製區域與貼上區域的大小或形狀不同"
IDS_MAIN_STDG_GRID_ERR_MSG3                   = "[ 錯誤 ] 群組名稱 %s 不存在"
IDS_MAIN_STDG_GRID_ERR_MSG4                   = "[ 錯誤 ] 貼上數據的位置尚未指派"
IDS_MAIN_STDG_GRID_ERR_MSG5                   = "[ 錯誤 ] 複製的內容已超出表格範圍"

IDS_MAIN_CALC_NON_MEMBER                      = "尚未選取要計算的購件"
IDS_MAIN_OUT_NON_MEMBER                       = "尚未選取要列印的購件"
IDS_MAIN_DGN_CALC_FAIL                        = "未成功計算 %s."
IDS_MAIN_DGN_INVALID_RCCODE					  = "Concrete standard is not compatible with steel standard for checking bolt. Concrete standard : %s"

IDS_MAIN_NOT_EXIST_GEN_FILE__s                = "不存在可執行的midas Gen檔案\n路徑 : %s"
IDS_MAIN_RENAME_ERROR_ONE_ITEM                = "請再試一次。 一次重新命名一個項目"

IDS_MAIN_GENERATE_DWG__s__s                   = "正在產生DWG檔 : %s %s"

IDS_MAIN_HYPER_LINK_ERROR_MEM                 = "記憶體不足"
IDS_MAIN_HYPER_LINK_ERROR_PATH                = "此路徑不存在"
IDS_MAIN_HYPER_LINK_ERROR_FILE                = "此檔案不存在"
IDS_MAIN_HYPER_LINK_ERROR_FORM                = "不合適的 .EXE 檔\n(non-Win32 .EXE or error in .EXE image)."
IDS_MAIN_HYPER_LINK_ERROR_ACCE                = "系統拒絕存取此檔案"
IDS_MAIN_HYPER_LINK_ERROR_INCP                = "不合適或不完整的檔案名稱"
IDS_MAIN_HYPER_LINK_ERROR_BUSY                = "The DDE transaction could not\nbe completed because other DDE transactions\nwere being processed."
IDS_MAIN_HYPER_LINK_ERROR_FAIL                = "The DDE transaction failed."
IDS_MAIN_HYPER_LINK_ERROR_TIME                = "The DDE transaction could not\nbe completed because the request time is out."
IDS_MAIN_HYPER_LINK_ERROR_DDL                 = "The specified dynamic-link library was not found."
IDS_MAIN_HYPER_LINK_ERROR_ASSO                = "There is no application associated\nwith the given filename extension."
IDS_MAIN_HYPER_LINK_ERROR_OOM                 = "There is no enough memory to complete the operation."
IDS_MAIN_HYPER_LINK_ERROR_SHAR                = "A sharing violation occurred."
IDS_MAIN_HYPER_LINK_ERROR__d                  = "Unknown Error (%d) occurred."
IDS_MAIN_HYPER_LINK_ERROR_OPEN                = "Unable to open hyperlink:\n\n"

IDS_MAIN_TITLE_START_PAGE                     = "開始"
IDS_MAIN_TITLE_MEMB                           = "構件"
IDS_MAIN_TITLE_MLST                           = "構件列表"
IDS_MAIN_TITLE_DRAW                           = "設計圖"
IDS_MAIN_TITLE_QUAN                           = "工程數量"
IDS_MAIN_TITLE_VDRW                           = "Vector Draw"
IDS_MAIN_TITLE_CUSTOM                         = "客制化..."
IDS_MAIN_TITLE_STANDARD                       = "標準"
IDS_MAIN_TITLE_RCS_DESIGN                     = "RC Design"
IDS_MAIN_TITLE_STL_DESIGN                     = "Steel Design"
IDS_MAIN_TITLE_SRC_DESIGN                     = "SRC Design"
IDS_MAIN_TITLE_ALU_DESIGN                     = "Aluminum Design"
IDS_MAIN_TITLE_MODE                           = "模式"
IDS_MAIN_TITLE_OPT                            = "選項"
IDS_MAIN_TITLE_LINK                           = "連結"
IDS_MAIN_TITLE_WORK_BAR                       = "工作欄"
IDS_MAIN_TITLE_REPORT                         = "報表"
IDS_MAIN_TITLE_DWG_PREVIEW                    = "Preview"
IDS_MAIN_TITLE_MEMBER_INFO                    = "Member Information"
IDS_MAIN_TITLE_WALL_INFO                      = "Wall Information"
IDS_MAIN_TITLE_MSG                            = "訊息欄"
IDS_MAIN_TITLE_UNDO                           = "&復原"
IDS_MAIN_TITLE_REDO                           = "&取消復原"
IDS_MAIN_TITLE_CHEK                           = "Check"

IDS_MAIN_GDBB_NON_MEMB                        = "There is no batch beam data."
IDS_MAIN_GDBB_USE_LINK                        = "Use Gen Link to get data."
IDS_MAIN_GDBB_RUN_SMRT                        = "Run Smart Design for All Beam Data?"

IDS_MAIN_GDBC_NON_MEMB                        = "There is no batch column data."
IDS_MAIN_GDBC_USE_LINK                        = "Use Gen Link to get data."
IDS_MAIN_GDBC_RUN_SMRT                        = "Run Smart Design for All Column Data?"

IDS_MAIN_GDBW_NON_MEMB                        = "沒有找到批量牆資料"
IDS_MAIN_GDBW_USE_LINK                        = "使用midas Link讀取資料"
IDS_MAIN_GDBW_RUN_SMRT                        = "對所有牆構件進行智能設計?"

IDS_MAIN_FAIL_MAKE_RIBBON_MENU                = "Failed at Create_Menu()"
IDS_MAIN_FAIL_MAKE_OUTPUT                     = "Failed at Create_ToolBar()"
IDS_MAIN_FAIL_MAKE_WORK_TREE                  = "Failed at Create_WorkTree()"
IDS_MAIN_FAIL_MAKE_TOOL_BAR                   = "Failed at Create_Output()"

IDS_MAIN_FAIL_MAKE_STAT_BAR                   = "Failed to create status bar\n"
IDS_MAIN_FAIL_MAKE_OUTP_BAR                   = "Failed to create output bar\n"
IDS_MAIN_FAIL_MAKE_WORK_BAR                   = "Failed to create Workspace bar\n"
IDS_MAIN_FAIL_MAKE_REPORT_BAR                 = "Failed to create Report bar\n"
IDS_MAIN_FAIL_MAKE_DWG_PREVIEW_BAR            = "Failed to create Drawing Preview bar\n"
IDS_MAIN_FAIL_MAKE_MEMBER_INFO_BAR            = "Failed to create Member Information bar\n"
IDS_MAIN_FAIL_MAKE_MENU_BAR                   = "Failed to create menu bar\n"
IDS_MAIN_FAIL_MAKE_DWG                        = "Fail to create drawing file."
IDS_MAIN_FAIL_OPEN_DWG__s                     = "Cannot open %s"
IDS_MAIN_WALL_COLUMN_IMPORTED                 = "wall or column data will be imported."

IDS_MAIN_PROTECTION__Err_PKID_Number_16       = "[錯誤] 序號為一組16個字元的字串"
IDS_MAIN_DGN_GURDW_CALC_FAIL_NOT_COMBINED__s  = "未成功計算 %s. Combined wall check can be performed when unit walls are connected to each other."

IDS_MAIN_SHOW_LOAD_COMBINATION_INFO           = "顯示載重組合資訊"
IDS_MAIN_ABNORAML_SETUP_TRIAL_VERSION         = "試用版程式未正確安裝\n請再一次執行 SETUP.exe 進行安裝 "
IDS_MAIN_ALLOWED_DURING_TIME                  = "授權將於試用版程式安裝後 ###天到期\n 若在 ###天後要繼續使用程式，請安裝正式版程式"
IDS_MAIN_INPUT_NAME                           = "請輸入名稱 "
IDS_MAIN_EXIST_SAME_NAME_INPUT_ANOTHER        = "名稱已被使用，請再次輸入名稱"
IDS_MAIN_FAIL_LINK                            = "連結失敗 "
IDS_MAIN_ENTER_USER_PASSWORD                  = "請輸入密碼"
IDS_MAIN_USER_PASSWORD_TOO_LONG_ENTER_USER_PASSWORD  = "密碼過長\n請再次輸入密碼"
IDS_MAIN_ENTER_USER_ID                        = "請輸入帳號名稱"
IDS_MAIN_USER_ID_TOO_LONG_ENTER_USER_ID       = "帳號名稱過長\n請再次輸入帳號"
IDS_MAIN_FAIL_AUTHENTICATION                  = "授權失敗"

IDS_MAIN_WORKTREE_BATCH_BEAM_SMART_OPT        = "智能設計選項"
IDS_MAIN_WORKTREE_BATCH_BEAM_BUILD_DATA       = "建物資料設定"
IDS_MAIN_WORKTREE_BATCH_BEAM_RUN_SMART        = "執行智能設計 ( All )"
IDS_MAIN_WORKTREE_BATCH_COLUMN_SMART_OPT      = "智能設計選項"
IDS_MAIN_WORKTREE_BATCH_COLUMN_BUILD_DATA     = "建物資料設定"
IDS_MAIN_WORKTREE_BATCH_COLUMN_RUN_SMART      = "執行智能設計 ( All )"
IDS_MAIN_WORKTREE_BATCH_WALL_SMART_OPT        = "智能設計選項"
IDS_MAIN_WORKTREE_BATCH_WALL_BUILD_DATA       = "建物資料設定"
IDS_MAIN_WORKTREE_BATCH_WALL_RUN_SMART        = "執行智能設計 ( All )"
IDS_MAIN_WORKTREE_DGN_CODE                    = "設計規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_RCS                = "RC規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_STL                = "鋼構規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_SRC                = "SRC規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_CFS                = "冷軋型鋼規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_ALU                = "鋁構規範 : %s"
IDS_MAIN_WORKTREE_DGN_CODE_RFM                = "補強規範 : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_WIND              = "風載重 : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_SNOW              = "雪載重 : %s"
IDS_MAIN_WORKTREE_LOAD_CODE_LIVE              = "活載重 : %s"
IDS_MAIN_WORKTREE_DB_CODE_RBAR                = "鋼筋資料庫 : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL                = "材料資料庫 : %s"
IDS_MAIN_WORKTREE_DB_CODE_SECT                = "斷面資料庫 : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL_FRP            = "材料資料庫 ( FRP ) : %s"
IDS_MAIN_WORKTREE_DB_CODE_MATL_FRS            = "材料資料庫 ( Steel ) : %s"
IDS_MAIN_WORKTREE_OPTION_STL                  = "鋼構選項"
IDS_MAIN_WORKTREE_OPTION_ALU                  = "鋁構材選項"
IDS_MAIN_WORKTREE_DGN_OPTION                  = "設計選項"
IDS_MAIN_WORKTREE_DWG_OPTION                  = "繪圖選項"
IDS_MAIN_WORKTREE_RPT_OPTION                  = "報表選項"
IDS_MAIN_WORKTREE_PREFERENCE                  = "偏好設定"

IDS_MAIN_DLL_MSG_INCONSISTENT                 = "Version of DLL is inconsistent."
IDS_MAIN_DLL_MSG_CANNOT_FIND_DLL              = "無法找到 %s."
